Revit 2025 API
MetallicpaintFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "MetallicpaintFinish" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum MetallicpaintFinishType
Public Enumeration MetallicpaintFinishType
public enum class MetallicpaintFinishType
type MetallicpaintFinishType
Members
Member name | Value | Description
Smooth | 0
Peeling | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace